Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.4.59/atdf/ATSAML22J18A.atdf
        <register name="SHPR3" offset="0xD20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="System Handler Priority Register 3">
          <bitfield name="PRI_14" caption="Priority of system handler 14, PendSV" mask="0xFF0000"/>
          <bitfield name="PRI_15" caption="Priority of system handler 15, SysTick exception" mask="0xFF000000"/>
        </register>
        <register name="SHCSR" offset="0xD24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="System Handler Control and State Register">
          <bitfield name="SVCALLPENDED" caption="no description available" mask="0x8000"/>
        </register>
        <register name="DFSR" offset="0xD30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Debug Fault Status Register">
          <bitfield name="HALTED" caption="Halt request debug event active" mask="0x1"/>
          <bitfield name="BKPT" caption="Breakpoint debug event" mask="0x2"/>
          <bitfield name="DWTTRAP" caption="DWT debug event" mask="0x4"/>
          <bitfield name="VCATCH" caption="Vector catch debug event" mask="0x8"/>
          <bitfield name="EXTERNAL" caption="EDBGRQ debug event" mask="0x10"/>
        </register>
      </register-group>
      <value-group name="SystemControl_ICSR__NMIPENDSET">
        <value name="VALUE_0" caption="Write: no effect; read: NMI exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes NMI exception state to pending; read: NMI exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the SysTick exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTSET">
        <value name="VALUE_0" caption="Write: no effect; read: SysTick exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes SysTick exception state to pending; read: SysTick exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the PendSV exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVSET">
        <value name="VALUE_0" caption="Write: no effect; read: PendSV exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes PendSV exception state to pending; read: PendSV exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__ENDIANNESS">
        <value name="VALUE_0" caption="Little-endian" value="0"/>
        <value name="VALUE_1" caption="Big-endian" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__SYSRESETREQ">
        <value name="VALUE_0" caption="No system reset request" value="0"/>
        <value name="VALUE_1" caption="Asserts a signal to the outer system that requests a reset" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SEVONPEND">
        <value name="VALUE_0" caption="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" value="0"/>
        <value name="VALUE_1" caption="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__STKALIGN">
        <value name="VALUE_0" caption="4-byte aligned" value="0"/>
        <value name="VALUE_1" caption="8-byte aligned" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SAML22J" caption="SAML22J">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="PA02"/>
      <pin position="4" pad="PA03"/>
      <pin position="5" pad="PB04"/>
      <pin position="6" pad="PB05"/>
      <pin position="7" pad="GNDANA"/>
      <pin position="8" pad="VDDANA"/>
      <pin position="9" pad="PB06"/>
      <pin position="10" pad="PB07"/>
      <pin position="11" pad="PB08"/>
      <pin position="12" pad="PB09"/>
      <pin position="13" pad="PA04"/>
      <pin position="14" pad="PA05"/>
      <pin position="15" pad="PA06"/>
      <pin position="16" pad="PA07"/>
      <pin position="17" pad="PA08"/>
      <pin position="18" pad="PA09"/>
      <pin position="19" pad="PA10"/>
      <pin position="20" pad="PA11"/>
      <pin position="21" pad="VDDIO"/>
      <pin position="22" pad="GNDIO"/>
      <pin position="23" pad="VLCD"/>
      <pin position="24" pad="PB11"/>
      <pin position="25" pad="PB12"/>
      <pin position="26" pad="PB13"/>
      <pin position="27" pad="PB14"/>
      <pin position="28" pad="PB15"/>
      <pin position="29" pad="PA12"/>
      <pin position="30" pad="PA13"/>
      <pin position="31" pad="PA14"/>
      <pin position="32" pad="PA15"/>
      <pin position="33" pad="GNDIO"/>
      <pin position="34" pad="VDDIO"/>
      <pin position="35" pad="PA16"/>
      <pin position="36" pad="PA17"/>
      <pin position="37" pad="PA18"/>
      <pin position="38" pad="PA19"/>
      <pin position="39" pad="PB16"/>
      <pin position="40" pad="PB17"/>
      <pin position="41" pad="PA20"/>
      <pin position="42" pad="PA21"/>
      <pin position="43" pad="PA22"/>
      <pin position="44" pad="PA23"/>
      <pin position="45" pad="PA24"/>
      <pin position="46" pad="PA25"/>
      <pin position="47" pad="GNDIO"/>
      <pin position="48" pad="VDDIO"/>
      <pin position="49" pad="PB22"/>
      <pin position="50" pad="PB23"/>
      <pin position="51" pad="PA27"/>
      <pin position="52" pad="RESET_N"/>
      <pin position="53" pad="VDDCORE"/>
      <pin position="54" pad="GNDIO"/>
      <pin position="55" pad="VSW"/>
      <pin position="56" pad="VDDIO"/>
      <pin position="57" pad="PA30"/>
      <pin position="58" pad="PA31"/>
      <pin position="59" pad="PB30"/>
      <pin position="60" pad="PB31"/>
      <pin position="61" pad="PB00"/>
      <pin position="62" pad="PB01"/>
      <pin position="63" pad="PB02"/>
      <pin position="64" pad="PB03"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
